informatievlaanderen-security-client/src/test/resources/claims-aware-service-request.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://www.agiv.be/IService/GetData</a:Action>
    <a:MessageID>urn:uuid:ba67c0ca-43ba-468e-b6dd-4f5cb8549e1c</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
    <a:To s:mustUnderstand="1">urn:informatievlaanderen.be/claimsawareservice/beta</a:To>
    <o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <u:Timestamp u:Id="_0"><u:Created>2011-12-19T08:43:14.339Z</u:Created><u:Expires>2011-12-19T08:48:14.339Z</u:Expires></u:Timestamp>
      <SecurityContextToken u:Id="uuid-3650465b-543a-48cc-b0c2-bad58e051e07-4" xmlns="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512">
        <Identifier>urn:uuid:c75d9758-b247-4031-8fe5-cf13ff847b02</Identifier>
      </SecurityContextToken>
      <Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/><Reference URI="#_0"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><DigestValue>y5iOtB2zMKSnpX3MYTqZZner7zU=</DigestValue></Reference></SignedInfo><SignatureValue>7fdwcK31+T5nfNpEndfmgAsBins=</SignatureValue><KeyInfo><o:SecurityTokenReference><o:Reference URI="#uuid-3650465b-543a-48cc-b0c2-bad58e051e07-4"/></o:SecurityTokenReference></KeyInfo></Signature>
    </o:Security>
  </s:Header>
  <s:Body>
    <GetData xmlns="http://www.agiv.be">
      <value>0</value>
    </GetData>
  </s:Body>
</s:Envelope>
